{
    "authors": [
      {
        "name": "Ada Lovelace",
        "title": "Mathematician",
        "subtitle": "Pioneer of computer programming",
        "dates": "1815–1852",
"imgUrl": "https://upload.wikimedia.org/wikipedia/commons/a/a4/Ada_Lovelace_portrait.jpg",
"attribution": "Alfred Edward Chalon, Public domain, via Wikimedia Commons",
        "text":"The first line of code ever written is attributed to Ada Lovelace, a 19th century mathematician and writer.Lovelace was the daughter of famed poet Lord Byron and Annabella Milbanke Byron, who legally separated two months after her birth. Her father then left Britain forever, and his daughter never knew him personally. She was educated privately by tutors and then self-educated but was helped in her advanced studies by mathematician-logician Augustus De Morgan, the first professor of mathematics at the University of London. She worked with Charles Babbage on his early mechanical general-purpose computer, the Analytical Engine, and is considered the first computer programmer. \n Lovelace wrote an algorithm in 1843 intended to be processed by the Analytical Engine to calculate Bernoulli numbers. This algorithm is the first example of computer programming, even though Babbage's machine was never fully constructed during their lifetimes. \n Her work was visionary and laid to the foundation for future programming and computing. Ada Lovelace visionary thinking went beyond mere number-crunching, which is what her contemporaries primarily focused on. Her notes on Babbage's Analytical Engine contain reflections that went much deeper, hinting at the idea that machines could do more than calculate, they could potentially process symbols and patterns to solve a variety of problems, this refers to the idea of processing information or executing algorithms based on data. She speculated that computers could one day create music, art, or even write text, as long as human provided the right instructions." 
 },
      {
        "name": "Aesop",
        "title": "Fabulist and Storyteller",
        "subtitle": "legendary Greek fabulist",
        "dates": "620–564 BCE",
"imgUrl":"https://upload.wikimedia.org/wikipedia/commons/6/63/Aesop_pushkin01.jpg",
"attribution": "user:shakko, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
        "text":"Considered the initiator of the fable as a written literary form, Aesop tells archetypal fables, that is, short compositions in which, in most cases, the protagonists are anthropomorphized animals. \nSome of the most famous fables are: 'The Fox and the Grapes,' 'The Goose That Laid the Golden Eggs,' and 'The Ant and the Grasshopper.' These have an educational and didactic purpose, as they aim to impart practical lessons, serving as exempla. \nAesop, traditionally credited as the author of a collection of Greek fables, is likely a legendary figure rather than a historical person. Ancient sources like Herodotus (5th century BCE) claimed he lived in the 6th century BCE as a slave, while Plutarch (1st century CE) suggested he advised King Croesus of Lydia. Some traditions say he was from Thrace, Phrygia, or even Ethiopia. An Egyptian text from the 1st century CE describes him as a slave on the island of Samos who later became a riddle-solver for King Lycurgus of Babylon before meeting his death at Delphi. It's likely the name Aesop was created to give authorship to fables, and his name became synonymous with fable. The value of these stories lay in the moral lessons they conveyed rather than the tales themselves." 
},
{
        "name": "Aldous Huxley",
        "title": "English writer, philosopher and screenwriter",
        "subtitle": "philosophical mysticism and universalism",
        "dates": "1894–1963",
"imgUrl":"https://upload.wikimedia.org/wikipedia/commons/9/91/Aldous_Huxley_-_photo_Henri_Manuel.jpg",
"attribution": "Henri Manuel, Public domain, via Wikimedia Commons",
        "text":"Aldous Huxley abandoned his dream of becoming a scientist to pursue a literary career after becoming partially blind in his young years. Huxley bibliography spans nearly 50 books, including essays and poems. He was a pacifist, coming from a family with a deep intellectual history. He grew interested in philosophical mysticism, as well as universalism,a school of thought in philosophy and spirituality which posits that the recurrence of common themes across world religions illuminates universal truths about the nature of reality, humanity, ethics, and consciousness. In his most famous novel Brave New World (1932), he presented a dystopian vision of a future society that revolves around science and efficiency. In this society, emotions and individuality are conditioned out of children at a young age, and there are no lasting relationships because -every one belongs to every one else. The reception of Brave New World at its publication was negative. Many were offended by the nature of Huxley’s future, and very few understood the novel’s philosophical implications. Many schools and libraries all over the world banned the novel, and even today it remains on lists of censored books." 
},
{
        "name": "bell hooks",
        "title": "American writer, educator and activist",
        "subtitle": "women's rights movement",
        "dates": "1952–2021",
"imgUrl":"https://upload.wikimedia.org/wikipedia/commons/3/37/Bell_hooks%2C_October_2014.jpg",
"attribution": "Alex Lozupone (Tduk), CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
        "text":" She preferred to spell her name in all lowercase letters to focus attention on her message rather than herself.  The focus of her writing was to explore the intersectionality of race, capitalism, and gender, and what she described as their ability to produce and perpetuate systems of oppression and class domination. Her work includes around 40 books, including essays, poetry, and children's books. She published numerous scholarly articles, appeared in documentary films, and participated in public lectures. Her work addressed love, race, social class, gender, art, history, sexuality, mass media, and feminism. Bell hooks was included in Utne Reader's 1995 '100 Visionaries Who Could Change Your Life' and included in TIME magazine's '100 Women of the Year' in 2020, where she was described as 'that rare rock star of a public intellectual who reaches wide by being accessible'." 
},


 {
        "name": "Oscar Wilde",
        "title": "Writer and Poet",
        "subtitle": "Known for his wit and plays",
        "dates": "1854–1900",
"imgUrl":"https://upload.wikimedia.org/wikipedia/commons/4/44/Oscar_Wilde_by_Napoleon_Sarony._Three-quarter-length_photograph%2C_seated.jpg",
"attribution":"Picture of Oscar Wilde",
        "text": "Oscar Wilde was an Irish poet and playwright. He is remembered for his epigrams and plays such as 'The Importance of Being Earnest'. He became one of the most popular playwrights in London in the early 1890s. In addition to his epigrams, his original fairy tales: The Happy Prince and Other Tales (1888) and A House of Pomegranates (1891), deserve more notice than they have generally received. A few of them are minor prose masterpieces, most notably \"The Happy Prince,\" \"The Nightingale and the Rose,\" \"The Selfish Giant\", and \"The Fisherman and His Soul.\" \n In July of 1889 Wilde settled down to write The Picture of Dorian Gray. This is his only novel, a blend of French decadence and English gothicism and is considered a literary manifesto of aestheticism." 
      },
{
        "name": "Emil Cioran",
        "title": "Romanian philosopher, aphorist and essayist",
        "subtitle": "Known for his wit and plays",
        "dates": "1854–1900",
        "imgUrl": "https://upload.wikimedia.org/wikipedia/commons/d/de/Cioran_in_Romania.jpg",
        "attribution":"Photographer of Keyston agency/Getty Images before Rivarol Premium. Photo taken in the last years of Cioran's life-in-Romania, before his definitive transference in France (1947); first publication 1955-1960s; for Romanian law the artistic and non-artistic photo realized before 1956, or between the years 1956-1996, have their copyright expired., Public domain, via Wikimedia Commons",
        "text": "Emil Cioran was born on 8 April 1911 in Răşinari (Transylvania), the son of an Orthodox priest. After completing his classical studies in Sibiu, he enrolled at the University of Bucharest, where he graduated with a thesis on Bergson. During this period, he read and studied authors such as Schopenhauer, Nietzsche, Kant and Leopardi, who had an impact on his thought and poetics. permeated by nihilism, scepticism and pessimism. His aphorisms, also due to personal experiences, initially a very severe form of insomnia that affected him from adolescence, are in fact pervaded by a deep bitterness and misanthropy, which are however served with acute irony and literary elegance. In the realm of philosophical thought, Cioran stands out as a figure who transcends the established norms of his time and does not belong to any specific movement or school of thought. His style is sharp, direct, and deeply emotional, filled with paradoxes, contradictions, and oxymorons. He wrote not to share his ideas with an audience, but rather to alleviate his own suffering and cause a kind of rude awakening from reality." 
      },
{
        "name": "Eduardo Galeano",
        "title": "Uruguayan journalist, writer and novelist",
        "subtitle": "A literary giant of Latin America left",
        "dates": "1940–2015",
        "imgUrl": "https://upload.wikimedia.org/wikipedia/commons/5/5d/Eduardo_Galeano_%282858983926%29.jpg",
        "attribution": "Mariela De Marchi Moyano from Vicenza, Italy, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
        "text": "Author Isabel Allende, said her copy of Galeano's book: \"Las venas abiertas de América Latina\" (Open Veins of Latin America, 1971), was one of the few items with which she fled Chile in 1973 after the military coup of Augusto Pinochet. With its fierce attack on European and US economic exploitation and political interventionism in Latin America, which he blamed for the region’s chronic poverty and underdevelopment, the book narrate the history of the region from the time of Columbus from the perspective of the subjugated people, and is considered one of Galeano's best-known works. A historian of Latin America, and a victim of two Latin American dictatorships, Galeano was  the author of many articles and books and won numerous awards, including the first-ever Lannan Prize for Cultural Freedom in 1999." 
      },
{
        "name": "Cesare Pavese",
        "title": "Italian writer, poet, translator, literary critic and essayist",
        "subtitle": "One of the most important authors and intellectuals in the history of Italian literature",
        "dates": "1908–1950",
"imgUrl":"https://upload.wikimedia.org/wikipedia/commons/a/af/Targa_in_Via_Lamarmora_a_Torino.JPG",
"attribution": "Pmk58, CC BY-SA 3.0 <https://creativecommons.org/licenses/by-sa/3.0>, via Wikimedia Commons",
        "text": "As a young man of letters graduating from the University of Turin with a thesis on the poetry of Walt Whitman, Pavese translated both classic and recent American and British authors that were then new to the Italian public. After University, Pavese threw himself into all manner of literary work, from producing his own poems, stories, and novels, to translating and editing English literature. Best defined as an aesthetic anti-fascist and anti-political ethicist, despite only marginally participating in anti-fascist meetings, it was at one of these that he fell in love with Tina Pizzardo, secretly a member of the Communist Party, for whom he received letters from a dissident's prison, and was imprisoned for it.  ‘The woman with the raspy voice’, as he called the love that came into his life in his later years of university studies, cost him a charge of suspected anti-fascism and a sentence of confinement. On his return in 1936, the woman had already married someone else. Disappointment plunged him into such a crisis that he contemplated suicide. In Rome, he meets the actress Constance Bowling, who will renew in him first the feeling of love, then the pain of abandonment. Pavese writes the famous poem: \"Verrà la morte e avrà i tuoi occhi\". Worn out, tired but ultimately perfectly lucid, he took his own life in a room of the Hotel Roma in Turin by swallowing a strong dose of barbiturates. Just a note, on the first page of the Dialogues with Leucò, on the bedside table in the room: ‘I forgive everyone and to everyone I ask forgiveness. All right? Don't gossip too much'. \n Pavese's work is intimately connected to his suffered human and intellectual life. From the very beginning of his literary interests, he seems to have tried his hardest in the difficult attempt to adapt his expressive abilities to his inner impulses. Myth assumes central importance in Pavese's poetics; Myth is the consecration of unique places linked to a fact or an event, a place is given absolute meaning, isolating it from the world; with the theory of myth, Pavese fixes and defines his original intuitions of childhood and the landscape linked to it. Childhood is the privileged moment in which myth is experienced spontaneously and unconsciously; when one realises this, childhood is lost; " 
      },
{
        "name": "Fela Kuti",
        "title": "Nigerian musician and activist",
        "subtitle": "The founder of Afro-beat",
        "dates": "1938–1997",
        "imgUrl":"https://upload.wikimedia.org/wikipedia/commons/6/60/Fela_Kuti_record.jpg",
        "attribution": "His master’s voice record company., CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
        "text": "Fela Kuti, a Nigerian musical hero, made history on the global music scene with his creation of the genre Afro-Beat.  Afro-Beat emerged as a genre in the late 1960s, and Fela Kuti is widely credited as its principal architect. It combines elements of jazz, Yoruba rhythms, and funk. Kuti was the son of feminist and labour activist Funmilayo Ransome-Kuti. He is adored and regarded as a legend. With his music, he gave a voice to the oppressed, used it as a tool to address important issues that had so far gone unheeded, such as the corruption of the Nigerian government, and encouraged social change. He sang in English and Yoruba. His politically charged songs, prompted authorities to routinely raid his club, looking for reasons to jail him. A 1977 raid on Fela's house by Nigerian authorities resulted in his brief incarceration, the assault of his wives and the defenestration of his mother, who died the following year due to complications from the fall. Despite all the challenges, after an exil in Ghana, he came back to found the political party: the Movement of the People, and ran unsuccessfully for the presidency of Nigeria. After all Kuti was a blunt supporter of human rights, his resistance and braveness made him one of the activist that shaped his country and represents his people. Since his death in 1997, Kuti’s legacy lives on and has birthed a new generation of activists who idolise his resilience in fighting the tyranny of the system. " 
      },
{
        "name": "Fyodor Dostoevsky",
        "title": "Russian novelist, essayist and journalist",
        "subtitle": "Spared from execution",
        "dates": "1821–1881",
"imgUrl": "https://upload.wikimedia.org/wikipedia/commons/8/8f/Dostoevsky.jpg",
        "attribution": "Constantin Shapiro, Public domain, via Wikimedia Commons",
        "text": "Fyodor Dostoevsky was a Russian novelist and short-story writer whose fierce penetration into the darkest side of the human mind, together with his unique writing style, had an immense influence on 20th-century. Dostoevsky was introduced to literature at an early age through fairy tales and legends, and through books by Russian and foreign authors. While working as an engineer, he translated some books to earn extra money. In 1840 he wrote his first novel: Poor Folks, which introduced him to the literary circles and costed him a death sentence to partecipate in one of them where banned books were discussed. However the sentence was commuted at the last moment. He spent four years in a Siberian prison camp, followed by six years of compulsory military service in exile. In the following years, he worked as a journalist. He was described as a pale, introverted dreamer and an over-excitable romantic. Despite the profoundity of his major works, he is commonly regarded as one of the greatest psychologists in the history of literature. In his works he analyses states of mind that lead to extreme actions and explore the deepest emotions and in so doing is treating timeless issues of philosophy. The Brothers Karamazov (Russian: Бра́тья Карама́зовы, Brát'ya Karamázovy), is the last novel by the Russian author. It has been acclaimed as one of the supreme achievements in world literature. " 
      },
{
        "name": "Gabriel García Márquez",
        "title": "Colombian novelist, essayist and journalist",
        "subtitle": "Magical Realism and the history of the emotions",
        "dates": "1927–2014",
        "imgUrl": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Gabriel_Garcia_Marquez.jpg",
        "attribution": "Jose Lara, CC BY-SA 2.0 <https://creativecommons.org/licenses/by-sa/2.0>, via Wikimedia Commons",
        "text": "Gabriel García Márquez was a Colombian novelist and one of the greatest writers of the 20th century, he was awarded the Nobel Prize for Literature in 1982, for his masterpiece: Cien años de soledad (1967, One Hundred Years of Solitude). He grew up between the mountains and the Caribbean Sea and received a pretty privileged education, but claimed as an adult that his most important literary sources were the stories about Aracataca and his family that his granddad had told him. He left law-school when young to became a self-made journalist. In the late 1960s he left journalism to devote himself to his creative writing full-time. He is one of the foremost interpreters of magical realism in literature, a genre in which the background narrative is set in a real place and time, but supernatural and dreamlike elements are part of the portrayal, reflecting a continent's life and conflicts. " 
      },
{
        "name": "Lou Reed",
        "title": " American musician and songwriter",
        "subtitle": "The singer of The Velvet Underground",
        "dates": "1942–2013",
        "imgUrl": "https://upload.wikimedia.org/wikipedia/commons/a/ae/Lou_Reed_street_art.jpg",
        "attribution": "Chelsea Marie Hicks, CC BY 2.0 <https://creativecommons.org/licenses/by/2.0>, via Wikimedia Commons",
        "text": "Lewis Allan Reed was an American guitarist, singer and songwriter. He studied poetry at Syracuse University. Although not commercially successful during its existence, the Velvet Underground came to be regarded as one of the most influential bands in the history of underground. After the band he had a solo career that spanned five decades.  "
      },
{
        "name": "Manly P. Hall",
        "title": "Canadian author, lecturer, astrologer and mystic.",
        "subtitle": "Formed in the Rosicrucian Society",
        "dates": "1901–1990",
        "imgUrl": "https://upload.wikimedia.org/wikipedia/commons/0/03/Bust_of_Manly_P._Hall.jpg",
        "attribution": "Mphsociety, CC BY-SA 4.0 <https://creativecommons.org/licenses/by-sa/4.0>, via Wikimedia Commons",
        "text":  "Manly P. Hall grew up without knowing his father; his mother was a member of the Rosicrucian society, which financed Manly a world tour in his younger years, thanks to which he studied the mysticism of different cultures in depth and wrote his self-published masterpiece: The Secret Teaching of All Ages. In 1936 he founded the Philosophical Research Society, a nonprofit organization dedicated to the study of religion, mythology, metaphysics, and the occult. In his life he gave thousand of lectures and wrote 150 books and essays. "

      },
{
        "name": "Rudolf Steiner",
        "title": "  Austrian-born spiritualist, lecturer ",
        "subtitle": "The founder of anthroposophy",
        "dates": "1861–1925",
        "imgUrl": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Steiner_um_1905.jpg",
        "attribution": "Otto Rietmann, Public domain, via Wikimedia Commons",
        "text": "Rudolf Steiner is the founder of anthroposophy, a philosophy based on the premise that the human intellect has the ability to contact spiritual worlds, with the premise of the existence of a spiritual world comprehensible to pure thought but fully accessible only to the faculties of knowledge latent in all humans. "
      },
{
        "name": "Octavia E. Butler",
        "title": "American science-fiction author",
        "subtitle": "Formed in the Rosicrucian Society",
        "dates": "1947–2006",
        "imgUrl": "https://upload.wikimedia.org/wikipedia/commons/8/83/Butler_signing_portrait.jpg",
        "attribution": "Nikolas Coukouma, CC BY 2.5 <https://creativecommons.org/licenses/by/2.5>, via Wikimedia Commons",
        "text": "Octavia Butler was a pioneer writer of science fiction. As one of the first African American and female science fiction writers, she wrote novels that concerned themes of injustice towards African Americans, pollution, women’s rights, diversity and political disparity. Her books are now taught in schools and universities across the U.S. Butler's protagonists are unconventional individuals who endure, compromise, and embrace radical change in order to survive. Her work is known for blending science fiction with African American spiritualism. She has been associated with the genre of Afrofuturism, a term coined by Mark Dery to describe - speculative fiction that treats African-American themes and addresses African-American concerns in the context of 20th-century technoculture .Butler won numerous prestigious awards for her writing. In 1995, she was awarded a MacArthur Genius Grant, the only science fiction writer to receive this award. She won Nebula and Hugo Awards, the two highest honors for science fiction, a PEN Lifetime Achievement Award, and the City College of New York’s Langston Hughes Medal in 2005. As a pioneer in science fiction, she opened up the genre to many other African American and female writers."
      },

{
        "name": "William Shakespeare",
        "title": " Canadian philosopher and writer",
        "subtitle": "Formed in the Rosicrucian Society",
        "dates": "1901–1990",
        "imgUrl":"https://upload.wikimedia.org/wikipedia/commons/f/fb/Cobbe_portrait_of_Shakespeare.jpg",
"attribution":"Cobbe Collection, Public domain, via Wikimedia Commons",
         "text": "Manly P. Hall "
      }
]
}










